[x, y] = meshgrid(-6:0.5:6);
u1 = y.^3 - 5.*y - x;
u2 = -x - y;
quiver(x, y, u1, u2);

% равновесни точки на системата
[t,x] = ode45(@solver,[0,4],[2,0]);
hold on
plot(x(:,1), x(:,2), 'r');
axis([-6,6,-6,6]);
[t,x] = ode45(@solver,[0,-4],[2,0]);
plot(x(:,1), x(:,2), 'g');
axis([-6,6,-6,6]);

% фазов портрет
a = [-4,-3,-2,-1,1,2,3,4,0,0,0,0,0,0,0,0,0];
b = [0,0,0,0,0,0,0,0,0,-4,-3,-2,-1,1,2,3,4];
hold on
for k = 1:length(a)
    [t,x] = ode45(@solver, [0,4],[a(k), b(k)]);
    plot(x(:,1), x(:,2),'b');
    [t,x] = ode45(@solver, [0,-4], [a(k), b(k)]);
    plot(x(:,1), x(:,2), 'r');
end
axis([-6,6,-6,6]);